# Activity 1: pandas Functions

1. Use Pandas to load the Titanic dataset

In [1]:
import pandas as pd

df = pd.read_csv('titanic.csv')
# Have a look at the first 5 sample of the data
df.head()

,Unnamed: 0,Cabin,Embarked,Fare,Pclass,Ticket,Age,Name,Parch,Sex,SibSp,Survived
0,0,NaN,S,7.2500,3,A/5 21171,22.0,"Braund, Mr. Owen Harris",0,male,1,0.0
1,1,C85,C,71.2833,1,PC 17599,38.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,female,1,1.0
2,2,NaN,S,7.9250,3,STON/O2. 3101282,26.0,"Heikkinen, Miss. Laina",0,female,0,1.0
3,3,C123,S,53.1000,1,113803,35.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,female,1,1.0
4,4,NaN,S,8.0500,3,373450,35.0,"Allen, Mr. William Henry",0,male,0,0.0

In [2]:
df.describe(include='all')

,Unnamed: 0,Cabin,Embarked,Fare,Pclass,Ticket,Age,Name,Parch,Sex,SibSp,Survived
count,1309.000000,295,1307,1308.000000,1309.000000,1309,1046.000000,1309,1309.000000,1309,1309.000000,891.000000
unique,NaN,186,3,NaN,NaN,929,NaN,1307,NaN,2,NaN,NaN
top,NaN,C23 C25 C27,S,NaN,NaN,CA. 2343,NaN,"Kelly, Mr. James",NaN,male,NaN,NaN
freq,NaN,6,914,NaN,NaN,11,NaN,2,NaN,843,NaN,NaN
mean,654.000000,NaN,NaN,33.295479,2.294882,NaN,29.881138,NaN,0.385027,NaN,0.498854,0.383838
std,378.020061,NaN,NaN,51.758668,0.837836,NaN,14.413493,NaN,0.865560,NaN,1.041658,0.486592
min,0.000000,NaN,NaN,0.000000,1.000000,NaN,0.170000,NaN,0.000000,NaN,0.000000,0.000000
25%,327.000000,NaN,NaN,7.895800,2.000000,NaN,21.000000,NaN,0.000000,NaN,0.000000,0.000000
50%,654.000000,NaN,NaN,14.454200,3.000000,NaN,28.000000,NaN,0.000000,NaN,0.000000,0.000000
75%,981.000000,NaN,NaN,31.275000,3.000000,NaN,39.000000,NaN,0.000000,NaN,1.000000,1.000000
max,1308.000000,NaN,NaN,512.329200,3.000000,NaN,80.000000,NaN,9.000000,NaN,8.000000,1.000000

2. We don't need the column **Unnamed: 0**, in the previous exercises we demonstrated how to remove the column using the **del** command.  How else could we remove this column, without using **del**?

In [3]:
df = df[df.columns[1:]] # Use the columns
df.head()

,Cabin,Embarked,Fare,Pclass,Ticket,Age,Name,Parch,Sex,SibSp,Survived
0,NaN,S,7.2500,3,A/5 21171,22.0,"Braund, Mr. Owen Harris",0,male,1,0.0
1,C85,C,71.2833,1,PC 17599,38.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,female,1,1.0
2,NaN,S,7.9250,3,STON/O2. 3101282,26.0,"Heikkinen, Miss. Laina",0,female,0,1.0
3,C123,S,53.1000,1,113803,35.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,female,1,1.0
4,NaN,S,8.0500,3,373450,35.0,"Allen, Mr. William Henry",0,male,0,0.0

3. Compute the mean standard deviation, minimum and maximum values for the columns of the dataframe **without** using **describe**

In [4]:
df.mean()

Fare        33.295479
Pclass       2.294882
Age         29.881138
Parch        0.385027
SibSp        0.498854
Survived     0.383838
dtype: float64

In [5]:
df.std()

Fare        51.758668
Pclass       0.837836
Age         14.413493
Parch        0.865560
SibSp        1.041658
Survived     0.486592
dtype: float64

In [6]:
df.min()

Fare        0.00
Pclass      1.00
Age         0.17
Parch       0.00
SibSp       0.00
Survived    0.00
dtype: float64

In [7]:
df.max()

Fare        512.3292
Pclass        3.0000
Age          80.0000
Parch         9.0000
SibSp         8.0000
Survived      1.0000
dtype: float64

4. What about the 33, 66 and 99% quartiles? How would we get these values using the individual method? As a hint the method quantile is the one to call (https://pandas.pydata.org/pandas-docs/stable/reference/frame.html )`

In [8]:
df.quantile(0.33)

Fare         8.559325
Pclass       2.000000
Age         23.000000
Parch        0.000000
SibSp        0.000000
Survived     0.000000
Name: 0.33, dtype: float64

In [9]:
df.quantile(0.66)

Fare        26.0
Pclass       3.0
Age         34.0
Parch        0.0
SibSp        0.0
Survived     1.0
Name: 0.66, dtype: float64

In [10]:
df.quantile(0.99)

Fare        262.375
Pclass        3.000
Age          65.000
Parch         4.000
SibSp         5.000
Survived      1.000
Name: 0.99, dtype: float64

5. How many passengers were from each class?  Answer using the *groupby* method:

In [11]:
class_groups = df.groupby('Pclass')
for name, index in class_groups:
    print(f'Class: {name}: {len(index)}')

Class: 1: 323
Class: 2: 277
Class: 3: 709

6. How many passengers were from each class?  Answer by using selecting / indexing methods to count the members of each class:

In [12]:
for clsGrp in df.Pclass.unique():
    num_class = len(df[df.Pclass == clsGrp])
    print(f'Class {clsGrp}: {num_class}')

Class 3: 709
Class 1: 323
Class 2: 277

7. Confirm the answers to 5 & 6 match
8. Determine who was the eldest passenger in the 3rd class?:

In [13]:
third_class = df.loc[(df.Pclass == 3)]

third_class.loc[(third_class.Age == third_class.Age.max())]

,Cabin,Embarked,Fare,Pclass,Ticket,Age,Name,Parch,Sex,SibSp,Survived
851,NaN,S,7.775,3,347060,74.0,"Svensson, Mr. Johan",0,male,0,0.0

9. For a number of machine learning problems it is very common to scale the numerical values between 0 and 1.  Use the agg method with lambda functions to scale the fare and age columns between 0 and 1.

In [14]:
fare_max = df.Fare.max()
age_max = df.Age.max()

df.agg({
    'Fare': lambda x: x / fare_max, 
    'Age': lambda x: x / age_max,
}).head()

       Fare     Age
0  0.014151  0.2750
1  0.139136  0.4750
2  0.015469  0.3250
3  0.103644  0.4375
4  0.015713  0.4375

10. There is one individual in the dataset without a listed Fare.

In [15]:
df_nan_fare = df.loc[(df.Fare.isna())]
df_nan_fare

,Cabin,Embarked,Fare,Pclass,Ticket,Age,Name,Parch,Sex,SibSp,Survived
1043,NaN,S,NaN,3,3701,60.5,"Storey, Mr. Thomas",0,male,0,NaN

  Replace the NaN value with the mean Fare for those corresponding with the same class and Embarked location using the groupby method

In [16]:
embarked_class_groups = df.groupby(['Embarked', 'Pclass'])

indices = embarked_class_groups.groups[(df_nan_fare.Embarked.values[0], df_nan_fare.Pclass.values[0])]
mean_fare = df.iloc[indices].Fare.mean()
df.loc[(df.index == 1043), 'Fare'] = mean_fare
df.iloc[1043]

Cabin                      NaN
Embarked                     S
Fare                   14.4354
Pclass                       3
Ticket                    3701
Age                       60.5
Name        Storey, Mr. Thomas
Parch                        0
Sex                       male
SibSp                        0
Survived                   NaN
Name: 1043, dtype: object